GadjetonOFF_Projeck/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПрав</name>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GadjetonOFF_Projeck/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокПрав.Очистить();
	
	НаборПрав = Метаданные.Роли;
	
	Для Каждого Роль Из НаборПрав Цикл
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли = Роль.Имя;
		СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
		
		СтрокаРоли.Включено = Пользователь.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)

	Пользавтьель = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользавтьель = Неопределено Тогда
		Пользавтьель = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользавтьель.Имя = Наименование;
		Пользавтьель.ПолноеИмя = ПолноеИмя;
	КонецЕсли;	

	Пользавтьель.Роли.Очистить();
	НайденныеСтроки = СписокПрав.НайтиСтроки(Новый Структура("Включено", Истина));
	
	Для Каждого ТекущаяРоль Из НайденныеСтроки Цикл
		
		Пользавтьель.Роли.Добавить(Метаданные.Роли.Найти(ТекущаяРоль.ИмяРоли));
				
	КонецЦикла;
	
	Пользавтьель.Записать();
	

КонецПроцедуры
